{
  "license": "CC-BY-4.0",
  "title": "Structural Interaction Fingerprints and Machine Learning for predicting and explaining binding of small molecule ligands to RNA: a benchmark dataset",
  "version": "0-1-1",
  "upload_type": "dataset",
  "publication_date": "2022-12-21",
  "language": "eng",
  "description": "<p><b>Structural Interaction Fingerprints and Machine Learning for predicting and explaining binding of small molecule ligands to RNA: a benchmark dataset.</b></p><p>Ribonucleic acids (RNA) play crucial roles in living organisms as they are involved in key processes necessary for proper cell functioning. Some RNA molecules, such as bacterial ribosomes and precursor messenger RNA, are targets of small molecule drugs, while others, e.g., bacterial riboswitches or viral RNA motifs are considered as potential therapeutic targets. Thus, the continuous discovery of new functional RNA increases the demand for developing compounds targeting them and for methods for analyzing RNA—small molecule interactions. We recently developed fingeRNAt - a software for detecting non-covalent bonds formed within complexes of nucleic acids with different types of ligands. The program detects several non-covalent interactions, such as hydrogen and halogen bonds, ionic, Pi, inorganic ion- and water-mediated, lipophilic interactions, and encodes them as computational-friendly Structural Interaction Fingerprint (SIFt). Here we present the application of SIFts accompanied by machine learning methods for binding prediction of small molecules to RNA targets. We show that SIFt-based models outperform the classic, general-purpose scoring functions in virtual screening. We discuss the aid offered by Explainable Artificial Intelligence in the analysis of the binding prediction models, elucidating the decision-making process, and deciphering molecular recognition processes.</p>",
  "notes": "This work was supported by the National Science Centre in Poland (grant number 2020/39/B/NZ2/03127 to F.S.)",
  "keywords": [
    "interaction fingerprints",
    "SIFts",
    "RNA",
    "small molecules",
    "non-covalent bonds",
    "machine learning",
    "XAI"
  ],
  "creators": [
    {
      "affiliation": "International Institute of Molecular and Cell Biology in Warsaw",
      "name": "Filip Stefaniak",
      "orcid": "0000-0001-5758-9416"
    },
    {
      "affiliation": "International Institute of Molecular and Cell Biology in Warsaw",
      "name": "Natalia A. Szulc",
      "orcid": "0000-0002-2991-3634"
    }
  ],
  "access_right": "open"
}
